In [1]:
import pandas as pd

In [3]:
events = pd.read_csv("events_ful.csv", header=None)
events.head()

          0         1           2     3          4   5        6  7
0  150-3302  order:UP  2012-03-05  user  Order: UP NaN  2859969  0
1  150-3302  order:DW  2011-07-19  user  Order: DW NaN  2859970  0
2  150-3302  order:IN  2011-05-04  user  Order: IN NaN  2859971  0
3  150-3302  order:NP  2015-07-01  user  Order: NP NaN  2859972  0
4  150-3302  order:UP  2013-08-20  user  Order: UP NaN  2859973  0

In [4]:
events.drop(5, axis=1, inplace=True)
events.head()

          0         1           2     3          4        6  7
0  150-3302  order:UP  2012-03-05  user  Order: UP  2859969  0
1  150-3302  order:DW  2011-07-19  user  Order: DW  2859970  0
2  150-3302  order:IN  2011-05-04  user  Order: IN  2859971  0
3  150-3302  order:NP  2015-07-01  user  Order: NP  2859972  0
4  150-3302  order:UP  2013-08-20  user  Order: UP  2859973  0

In [5]:
events.columns = ['case_id', 'activity_name', 'timestamp', 'resource', 'description', 'event_id', 'transactional']
events.head()

,case_id,activity_name,timestamp,resource,description,event_id,transactional
0,150-3302,order:UP,2012-03-05,user,Order: UP,2859969,0
1,150-3302,order:DW,2011-07-19,user,Order: DW,2859970,0
2,150-3302,order:IN,2011-05-04,user,Order: IN,2859971,0
3,150-3302,order:NP,2015-07-01,user,Order: NP,2859972,0
4,150-3302,order:UP,2013-08-20,user,Order: UP,2859973,0

In [6]:
events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 650734 entries, 0 to 650733
Data columns (total 7 columns):
case_id          650734 non-null object
activity_name    650734 non-null object
timestamp        650734 non-null object
resource         650734 non-null object
description      650734 non-null object
event_id         650734 non-null int64
transactional    650734 non-null int64
dtypes: int64(2), object(5)
memory usage: 34.8+ MB

In [7]:
events.to_csv("events_prepared.csv")

In [9]:
events.set_index('event_id', inplace=True)
events.head()

,case_id,activity_name,timestamp,resource,description,transactional
event_id,,,,,,
2859969,150-3302,order:UP,2012-03-05,user,Order: UP,0
2859970,150-3302,order:DW,2011-07-19,user,Order: DW,0
2859971,150-3302,order:IN,2011-05-04,user,Order: IN,0
2859972,150-3302,order:NP,2015-07-01,user,Order: NP,0
2859973,150-3302,order:UP,2013-08-20,user,Order: UP,0

In [10]:
events.to_csv("events_prepared.csv")

In [12]:
events.timestamp = events.timestamp.astype('datetime64')
events.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 650734 entries, 2859969 to 3557175
Data columns (total 6 columns):
case_id          650734 non-null object
activity_name    650734 non-null object
timestamp        650734 non-null datetime64[ns]
resource         650734 non-null object
description      650734 non-null object
transactional    650734 non-null int64
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 34.8+ MB

In [13]:
events.head()

,case_id,activity_name,timestamp,resource,description,transactional
event_id,,,,,,
2859969,150-3302,order:UP,2012-03-05,user,Order: UP,0
2859970,150-3302,order:DW,2011-07-19,user,Order: DW,0
2859971,150-3302,order:IN,2011-05-04,user,Order: IN,0
2859972,150-3302,order:NP,2015-07-01,user,Order: NP,0
2859973,150-3302,order:UP,2013-08-20,user,Order: UP,0

In [15]:
import datetime
lastDate = datetime.date(year=2039,month=1,day=1)
events_filtered = events[events.timestamp < lastDate]
events_filtered.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 586179 entries, 2859969 to 3557175
Data columns (total 6 columns):
case_id          586179 non-null object
activity_name    586179 non-null object
timestamp        586179 non-null datetime64[ns]
resource         586179 non-null object
description      586179 non-null object
transactional    586179 non-null int64
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 31.3+ MB

In [16]:
events_filtered.to_csv("events_without_promo_end.csv")